---
kind: property
id: P:Autodesk.Revit.DB.ScheduleFieldId.InvalidScheduleFieldId
source: html/c85dab45-d373-be75-c2d7-da14eded967c.htm
---
# Autodesk.Revit.DB.ScheduleFieldId.InvalidScheduleFieldId Property

Get the invalid ScheduleFieldId whose IntegerValue is -1.

## Syntax (C#)
```csharp
public static ScheduleFieldId InvalidScheduleFieldId { get; }
```